[
   {
      "content": [
         {
            "name": "Hack Week", 
            "url": "http://princetoneclub.com/collection/hack-week-2", 
            "on campus": true, 
            "details": "Stay on campus for intersession and build a prototype that could form the basis of a startup in just a week, all the while getting mentored by big time entrepreneurs and attending classes with some of the best programmers and designers in the industry. You'll get hands-on experience about both the technical and business aspects of doing a startup, and you'll add an awesome project to your portfolio.", 
            "date": "2014/01/28", 
            "organizer": "E-Club"
         }, 
         {
            "name": "HackPrinceton", 
            "url": "http://hackprinceton.com", 
            "on campus": true, 
            "details": "HackPrinceton provides Princeton students with a wonderful opportunity to hack, work together and grow their technical skills and experience converting an idea from concept to reality. It’s also a wonderful way for students to learn new things and share what they know with others.", 
            "date": "2013/11/08", 
            "organizer": "E-Club"
         }, 
         {
            "date": "NULL", 
            "organizer": "U. of Penn.", 
            "on campus": false, 
            "details": "PennApps is a 48-hour hackathon (app development competition) at the University of Pennsylvania where the top student engineers, designers, and entrepreneurs from universities all over the US come together to showcase technical achievements and compete for cash prizes.", 
            "name": "PennApps"
         }, 
         {
            "date": "NULL", 
            "organizer": "E-Club", 
            "on campus": true, 
            "details": "The Princeton Entrepreneurship Club’s annual startup challenge. Submit a first round application answering a few questions about your startup idea and team. After semi-finalists are announced, you will be paired up with mentors and be able to submit either a product demo or a business plan.", 
            "name": "TigerLaunch"
         }, 
         {
            "date": "2013/09/25", 
            "organizer": "E-Club", 
            "on campus": true, 
            "details": "Princeton Pitch is an annual competition organized by the Princeton Entrepreneurship Club that gives students the chance to win $1,000 for an entrepreneurial or social entrepreneurial startup idea they have. During the event, students have the opportunity to participate in mentorship sessions with tech revolutionaries as well as to receive constructive feedback from experienced entrepreneurs, faculty and fellow students.", 
            "name": "Princeton Pitch"
         }
      ], 
      "name": "Competitions"
   }, 
   {
      "content": [
         {
            "url": "https://www.princeton.edu/cbli/", 
            "details": "The Community-Based Learning Initiative (CBLI) connects students' academic work with their interest in and concern for the communities around the University. Working with local nonprofits, students develop research projects, collect and analyze data, and share their results and conclusions, not just with their professors, but also with organizations and agencies that can make use of the information. Working with CBLI, students can do community-based research in courses, as a summer research internship, and as part of their junior paper or senior thesis.", 
            "name": "Community-Based Learning Initiative"
         }, 
         {
            "url": "http://dormroomfund.com", 
            "details": "Dorm Room Fund is a student-run venture firm that invests in student-run companies. Our team is all students and our mission is to inspire and support more careers in the startup industry. We believe that a relatively small amount of capital can help student founders take their ideas from the dorm room to the market. We are laser-focused on working with the best student talent in the world. We're backed by First Round Capital.", 
            "name": "Dorm Room Fund"
         }, 
         {
            "url": "http://kellercenter.princeton.edu/elab/", 
            "details": "The Keller Center’s eLab Summer Accelerator Program at Princeton University is a launch pad for student startups, a creative co-working space open, by application only, to some of Princeton’s brightest and most dynamic students.  An exceptional 10-week long summer program awaits these students as they learn from the best innovators and investors and fine tune their nascent start up ideas to develop them into viable and scalable ventures.  Over a period of 10 weeks, students will work together in a supportive community of fellow entrepreneurs, assigned mentors, and participate in training sessions and workshops.", 
            "name": "eLab"
         }, 
         {
            "url": "http://www.tigerlabs.co", 
            "details": "Tigerlabs is an entrepreneurship campus founded by serial entrepreneurs & venture capitalists with the goal of organizing the fast growing but disjointed startup ecosystem of Princeton, NJ.", 
            "name": "Tigerlabs"
         }, 
         {
            "url": "http://www.tiger2tiger.org", 
            "details": "Princeton University's Class of 2002 has begun a legacy community service project to launch the Tiger2Tiger program, which will enable graduating Princeton seniors to pursue inspiring projects with immediate relevance and impact.", 
            "name": "Tiger2Tiger"
         }
      ], 
      "name": "Funding"
   }, 
   {
      "content": [
         {
            "url": "http://www.university.firstround.com", 
            "details": "With this one application, engineering students can apply for summer internships or full-time jobs at over 170 amazing startup companies.  Maybe you're an algorithms and data junkie looking to work on insanely tough problems with a small team in SF, or perhaps you're more interested in doing iOS development for an eCommerce company in NYC  – just tell us about yourself, your interests and desired location and we'll take care of the rest.   If you're a student, you can apply here now. \n\nRead more: http://firstround.com/article/Apply-to-work-at-170-startups-with-one-Common-Application#ixzz2g3GEPbgh", 
            "name": "First Round Capital Common Application"
         }, 
         {
            "url": "http://apply.hackny.org", 
            "details": "The hackNY Fellows program, now entering its fourth year, is an intense program designed to introduce students to NYC's startup ecosystem by pairing the best technical minds with great New York startups.", 
            "name": "hackNY Fellows"
         }, 
         {
            "url": "http://www.princeton.edu/oip/iip/", 
            "details": "Princeton's International Internship Program (IIP) supports Princeton undergraduates who wish to undertake a summer internship abroad. IIP is partnering with an increasing number of University programs, departments, and centers to support internship placements in every region of the world and across diverse areas of professional and academic interests.\n\nIf you are a freshman, sophomore, or junior interested in spending a summer abroad doing work related to your academic concentration or interests, we encourage you to explore the listings on our website and to contact us with any questions.", 
            "name": "International Internship Program"
         }, 
         {
            "url": "http://commons.princeton.edu/kellercenter/internships/summer.html", 
            "details": "Established in February 2005, the mission of Princeton's Keller Center is to \"educate students to be leaders in a technology-driven society\". The Keller Center is creating new courses and strengthening existing ones that go beyond purely technical subjects to provide students a broader understanding of the global economic, environmental and cultural forces that shape and are shaped by technology. At the same time, the center is enriching students' education by supporting student engineering projects in the community, providing internships, hosting a variety of lecture series, and exposing them to entrepreneurial opportunities.\n", 
            "name": "Keller Center Internships"
         }, 
         {
            "url": "http://kpcbfellows.com", 
            "details": "Our KPCB Fellows Program offers outstanding college students from across the United States an opportunity to gain significant experience working on unique and challenging technical or design problems, and to develop new relationships that are meaningful to their careers.\n\nOver the course of a summer, KPCB Fellows will be employed at our portfolio companies, where they can develop their technical or design skills and be mentored by an executive within the company. Fellows will also be invited to attend private events held by KPCB and events hosted by portfolio companies, where they can meet other talented engineering and design students, network with luminaries in their respective field, and explore the San Francisco Bay Area.", 
            "name": "KPCB Fellows"
         }, 
         {
            "url": "http://nationsservice.org/internships", 
            "details": "Hello! Welcome to Nations' Service, a resource for students and alumni looking for a way to do well by doing good.\n\nThis wiki is being developed so that it can be used as a free, collaborative resource for university students and alumni to explore a wide variety of career paths together, and to discuss alternatives to the seemingly limited options students see as they approach graduation.", 
            "name": "Nation's Service"
         }, 
         {
            "url": "http://www.princeton.edu/career/undergrads/internships/", 
            "details": "Career Services is committed to assisting the undergraduate and graduate students, and alumni of Princeton University in all areas of career planning, including exploring career-related interests, applying to graduate or professional schools, and developing effective strategies for the pursuit of full-time employment, internships, or other experiential learning opportunities.", 
            "name": "Career's Services"
         }, 
         {
            "url": "https://princeton.experience.com/experience/login", 
            "details": "TigerTracks is Princeton's electronic recruiting system that holds literally hundreds of listings for jobs, fellowships, and internships. New opportunities are continually added to TigerTracks!\n\nTigerTracks is used to manage the on-campus recruiting program which coordinates the visits of employers for interviews,  information sessions, and other recruiting events. Check TigerTracks regularly to view upcoming employer events and on-campus interviews. You can also use TigerTracks to research and contact recruiters, manage your application materials, apply for positions, and sign up for on-campus interviews.\n\nBe sure to fill out your profile thoroughly once you have accessed your account. Keeping all sections of your profile up-to-date, especially your concentration and employment preferences, will ensure that you receive targeted email announcements from Career Services (on behalf of recruiting organizations) when relevant opportunities and events arise.", 
            "name": "Tiger Tracks"
         }
      ], 
      "name": "Internships"
   }
]